{
  "subtitle": "Ignore pressures from other youth", 
  "description": "", 
  "language": "eng_GB", 
  "title": "How are your relationships?", 
  "primary_category": "28a68efc21904bcc91010123941c7d16", 
  "created_at": "2015-06-15T17:02:13+00:00", 
  "featured_in_category": true, 
  "modified_at": "2015-06-17T13:33:52.618139+00:00", 
  "_version": {
    "package_version": "1.2.0", 
    "language_version": "2.7.6", 
    "language": "python", 
    "language_version_string": "2.7.6 (default, Mar 22 2014, 23:03:41) \n[GCC 4.8.2]", 
    "package": "elastic-git"
  }, 
  "linked_pages": [], 
  "id": null, 
  "content": "\r\n\r\nOne of my close friends told me that I would lose my girlfriend if I didn’t satisfy her sexually. Surely this made me very anxious so I started to experiment with her, even though she was not in the mood. This made me even more worried. Then I asked why she’s not in the mood. She explained that making love could cause unwanted pregnancy and if this happens, we would lose our dignity from the community. At the end we realized that lovers need to have mutual respect and understanding and they need to ignore the pressure from other youth.”\r\n\r\n**Facts:**\r\n\r\nHealthy Sexuality: Being sexually healthy means that you can express your sexual feelings in ways that are not harmful to yourself or to anyone else. You don't have to take risks with your own feelings and health. As a young person, you can start informing yourself about the facts pertaining to sex. Take off some time to think about your choices related to sexual activity. It could be \"No sex\" or \"Not Yet\". It is good to wait before rushing into sexual intercourse.\r\n\r\n**Act Now:**\r\n\r\nFor more information, SMS 6300 or visit a Straight Talk Youth Centre in your area.", 
  "source": null, 
  "featured": true, 
  "author_tags": [], 
  "image": null, 
  "published": null, 
  "position": 2, 
  "image_host": "http://qa.thumbor.unicore.io", 
  "slug": "how-are-your-relationships", 
  "uuid": "c215e7dfdd8c4edd9ad29f9528961923"
}