{
  "subtitle": "", 
  "description": "", 
  "language": "eng_GB", 
  "title": "Managing your Menstruation can be really easy", 
  "primary_category": "28a68efc21904bcc91010123941c7d16", 
  "created_at": "2015-06-15T16:57:18+00:00", 
  "featured_in_category": true, 
  "modified_at": "2015-06-15T17:45:31.762636+00:00", 
  "_version": {
    "package_version": "1.2.0", 
    "language_version": "2.7.6", 
    "language": "python", 
    "language_version_string": "2.7.6 (default, Mar 22 2014, 23:03:41) \n[GCC 4.8.2]", 
    "package": "elastic-git"
  }, 
  "linked_pages": [], 
  "id": null, 
  "content": "**Story**\r\n\r\n“It happened in class with all my classmates around. I stood up to go to the toilet. Then I realized I had stained my dress. Oh, it was such a terrible experience. I was so embarrassed. My friends helped me, but I spent the whole week at home.\"\"\r\n\r\n**Facts**\r\n\r\nMenstruation happens when a girl’s body releases blood from her uterus through the vagina. The blood flows slowly for about 4-7 days in a month. Girls usually begin menstruating between the age of nine and 16. Everyone has their own time of starting because our bodies are different. Some girls may start menstruating when they are only 8 years while others may start when they are 16 years. However, if you are 17 and above and you have not yet started menstruating, see a doctor.Once a girl starts getting her periods, it comes once a month. But some girls may miss their periods for one or two months. This is alright. The hormones in the body are not balanced yet. If you are not having sex, don’t worry about missed period. For girls who are having sex, a missed period may be a sign of pregnancy. Girls and boys, say NO to sex until you are over 18 years, after your studies and you can look after a family. Menstruation is one of the body changes girls get during puberty. \r\n\r\n**Act Now**\r\n\r\nTips on making your periods easier:\r\nAlways be prepared. Keep track of when your periods are due so that you are not caught by suprise. Avoid eating too much salt because salt causes your body to retain extra water especiallly around the time of your periods. Drink plenty of water.                                                                                                                          What to use: With or without money, you can deal with your periods just fine. You can use clean cotton clothes, toilet tissue,pads, or tampons. However, you need to change these freqently to aoid staining and bad smells. For more information, SMS to 6300 or visit a Straight Talk Youth Centre in your area.", 
  "source": null, 
  "featured": true, 
  "author_tags": [], 
  "image": null, 
  "published": null, 
  "position": 4, 
  "image_host": "http://qa.thumbor.unicore.io", 
  "slug": "managing-your-menstruation-can-be-really-easy", 
  "uuid": "e1e12b440795421bb53cb543c1097812"
}